company_text = (
'🌟 ПАО «Мосэнерго» — крупнейшая территориальная генерирующая компания в России! 🌍\n\n'
'В состав «Мосэнерго» входит 15 теплоэлектроцентралей, расположенных в Москве и Московской области, а также районные и квартальные тепловые станции.\n\n'
'💡 Наши производственные объекты обеспечивают более 50% электрической энергии, потребляемой в Московском регионе, и около 90% потребностей Москвы в тепловой энергии.\n\n'
'👷‍♂️ Численность персонала компании — более 7 тысяч человек!'
)


motivations_programms = [
    ('Наша компания ценит своих сотрудников и предоставляет\n'
     'возможность развиваться до руководящих позиций\n'
     'благодаря программе кадрового резерва 👥'),

    ('Поддержание уровня квалификации сотрудников — один\n'
    'из главных приоритетов Мосэнерго. Поэтому, помимо\n'
    'обучения в корпоративном Учебном центре, у вас есть\n'
    'шанс пройти профпереподготовку или повысить\n'
    'квалификацию по профильному направлению в НИУ МЭИ 📚'),

    ('Сотрудники Мосэнерго ежегодно демонстрируют свой\n'
    'профессионализм не только на рабочих местах, но и на\n'
    'соревнованиях по оперативной работе, ремонту, охране\n'
    'труда, пожарной безопасности и многих других\n'
    'направлениях!🏆'),

    ('Движение — это жизнь! Ежегодно мы проводим более 40\n'
    'спортивных соревнований по различным видам спорта: от\n'
    'футбола до шахмат, и даже по игре в городки!⚽'),

    ('В нашей компании вы можете развиваться не только\n'
    'профессионально, но и творчески. Концерты, фестивали,\n'
    'конкурсы — это отличная возможность проявить свои\n'
    'скрытые таланты! 🎉'),

    ('Хотите найти единомышленников и почувствовать себя\n'
    'частью большой команды, принять участие в интересных\n'
    'мероприятиях? Присоединяйтесь к совету молодых\n'
    'специалистов! 🤝\n\n'
    'Вместе мы достигнем больших высот! 🔝'),
]


company_benefit = (
'✨ Оформление по ТК, стабильная выплата заработной платы 2 раза в месяц, премии и надбавки.\n\n'
'🏡 Возможность работать рядом с домом – на одной из 15 ТЭЦ.\n\n'
'🍽️ Компенсация питания в столовых филиалов.\n\n'
'🚛 Для иногородних кандидатов: компенсация переезда, аренды жилья и проезда из дальних городов МО.\n\n'
'🏥 ДМС со стоматологией после трех месяцев работы.\n\n'
'💼 Страхование жизни и негосударственное пенсионное обеспечение.\n\n'
'🤝 Коллективный договор (МГК «Электропрофсоюз»): выплаты и льготы.\n\n'
'🛡️ Обеспечение средствами индивидуальной защиты и спецодеждой.'
)


company_filiales = (
'📍 ГЭС-1: Москва, ул. Садовническая, д. 11\n'
'📍 ТЭЦ-8: Москва, Остаповский пр-д, д. 1\n'
'📍 ТЭЦ-9: Москва, ул. Автозаводская, д. 12, корп. 1\n'
'📍 ТЭЦ-11: Москва, шоссе Энтузиастов, д. 32\n'
'📍 ТЭЦ-12: Москва, Бережковская наб., д. 16\n'
'📍 ТЭЦ-16: Москва, ул. 3-я Хорошевская, д. 14\n'
'📍 ТЭЦ-17: Ступино, ул. Фрунзе, вл. 19\n'
'📍 ТЭЦ-20: Москва, ул. Вавилова, д. 13\n'
'📍 ТЭЦ-21: Москва, ул. Ижорская, д. 9\n'
'📍 ТЭЦ-22: Дзержинский, ул. Энергетиков, д. 5\n'
'📍 ТЭЦ-23: Москва, ул. Монтажная, д. 1/4\n'
'📍 ТЭЦ-25: Москва, ул. Генерала Дорохова, д. 16\n'
'📍 ТЭЦ-26: Москва, Востряковский пр-д, домовладение 10\n'
'📍 ТЭЦ-27: Мытищинский район, п. Челобитьево, Волковское шоссе, 1'
)


FAQ = [
    (
        '🔹 График ДНВВ (Д-день, Н-ночь, В-выходной; День - 08:00-20:00, Ночь - 20:00-08:00):\n'
        '- ГЭС-1\n'
        '- ТЭЦ-20\n'
        '- ТЭЦ-22\n\n'
        '🔹 График ДДННВВВ (Д-день, Н-ночь, В-выходной; День - 08:00-20:00, Ночь - 20:00-08:00):\n'  
        '- ТЭЦ-9\n\n'
        '🔹 График ДДВННВВВ (Д-день, Н-ночь, В-выходной; День - 08:00-20:00, Ночь - 20:00-08:00):\n'  
        '- ТЭЦ-8\n'
        '- ТЭЦ-11\n'
        '- ТЭЦ-12\n'
        '- ТЭЦ-16\n'
        '- ТЭЦ-17\n'
        '- ТЭЦ-21\n'
        '- ТЭЦ-23\n'
        '- ТЭЦ-25\n'
        '- ТЭЦ-26\n'
        '- ТЭЦ-27'
    ),

    (
        'Мы предлагаем конкурентоспособную зарплату.\nБолее подробно готовы обсудить это на собеседовании! 😊 '
    ),

    (
        '- Компенсация расходов на аренду жилья до 31 000 рублей.\n'  
        '- Единовременная выплата при переезде в г. Москву – 93 000 рублей.\n'
        '- Для кандидатов из Московской области предусмотрена компенсация проезда:\n'  
        '  - 18 000 рублей – для дальних городов (Шатура, Коломна, Кашира).\n'
        '  - 3 450 рублей – для населенных пунктов в пределах 60 км от МКАД.'
    ),

    (
        'Мосэнерго заботится о своих сотрудниках и предоставляет:\n'
        '- ДМС со стоматологией после трех месяцев работы\n'  
        '- Страхование жизни\n'
        '- Негосударственное пенсионное обеспечение\n'
        '- Коллективный договор (МГК «Электропрофсоюз»): выплаты и льготы\n'
        '- Компенсация питания в столовых филиалов\n'
    ),

    (
        'ГЭС-1, Москва, ул. Садовническая, д. 11\n'
        'ТЭЦ-8, Москва, Остаповский пр-д, д. 1\n'
        'ТЭЦ-9, Москва, ул. Автозаводская, д. 12, корп.1\n'
        'ТЭЦ-11, Москва, шоссе Энтузиастов, д. 32\n'
        'ТЭЦ-12, Москва, Бережковская наб., д. 16\n'
        'ТЭЦ-16, Москва, ул. 3-я Хорошевская, д. 14\n'
        'ТЭЦ-17, Ступино, ул. Фрунзе, вл. 19\n'
        'ТЭЦ-20, Москва, ул. Вавилова, д. 13\n'
        'ТЭЦ-21, Москва, ул. Ижорская, д. 9\n'
        'ТЭЦ-22, Дзержинский, ул. Энергетиков, д. 5\n'
        'ТЭЦ-23, Москва, ул. Монтажная, д. 1/4\n'
        'ТЭЦ-25, Москва, ул. Генерала Дорохова, д. 16\n'
        'ТЭЦ-26, Москва, Востряковский пр-д, домовладение 10\n'
        'ТЭЦ-27, Мытищинский район, п. Челобитьево, Волковское шоссе 1\n'
        'ТЭЦ-30, Павловский Посад, Большой Железнодорожный пр., 25А\n'
    ),

    (
        '<u>Список начальных вакансий без опыта и профильного образования:</u>\n'
        '- Машинист-обходчик по котельному / турбинному оборудованию\n'
        '- Аппаратчик ХВО\n'
        '- Машинист насосных установок\n\n'

        '<u>Начальные вакансии, на которые можно прийти без опыта после окончания вуза/ссуза:</u>\n'
        '- Машинист-обходчик по котельному / турбинному оборудованию\n'
        '- Аппаратчик ХВО\n'
        '- Машинист насосных установок\n'
        '- Электромонтер по ремонту и обслуживанию электрооборудования электростанции\n'
        '- Электрослесарь по ремонту и обслуживанию автоматики и средств измерений электростанции\n'
        '- Слесарь по ремонту парогазотурбинного оборудования\n'
        '- Слесарь по ремонту оборудования котельных и пылеприготовительных цехов\n'
        '- Лаборант химического анализа\n'
    ),
    
    (
        'Список документов, необходимых для трудоустройства:\n'
        '- Паспорт РФ\n'
        '- Документы об образовании\n'
        '- СНИЛС\n'
        '- ИНН\n'
        '- Трудовая книжка\n'
        '- Документы воинского учета\n'
    ),
   
    (
        'В компании существуют программы для профессионального и карьерного развития:\n'
        '- Кадровый резерв\n'
        '- Программы подготовки по должности\n'
        '- Наставничество\n'
        '- Профессиональная переподготовка и повышение квалификации за счет работодателя\n'
        '- Соревнования профессионального мастерства\n'
        '- Ротации между филиалами\n'
    ),
]
