admin_main_menu_keyboard = [
    ['Вакансии', 'vacancies'],
    ['О компании', 'about_company'],
    ['Частые вопросы', 'FQA'],
    ['Мои данные', 'user_data'],
    ['Контакты', 'contacts'],
    ['Панель администратора', 'admin_soft']
]

admin_options_keyboard = [
    ['Рассылка'],
    ['Метрика'],
    ['Главное меню']
]

user_main_menu_keyboard = [
    ['Вакансии', 'vacancies'],
    ['О компании', 'about_company'],
    ['Частые вопросы', 'FQA'],
    ['Мои данные', 'user_data'],
    ['Контакты', 'contacts'],
]

vacancies_menu_keyboard = [
    ['Посмотреть все вакансии'],
    ['Категории'],
    ['Вакансии без опыта'],
    ['Главное меню']
]

warning_options_keyboard = [
    ['Рискну'],
    ['Главное меню'],

]

vacancies_categories_keyboard = [
    ['ТЭЦ'],
    ['Офис'],
    ['Стажировка'],
    ['Главное меню']
]

power_vacancies_keyboard = [
    ['Теплоэнергетика', 'Электроэнергетика'],
    ['АСУ ТП', 'РЗА'],
    ['Ремонт', 'Химия'],
    ['HR', 'ИТ'],
    ['Экономика', 'Сбыт'],
    ['Промышленная безопасность и охрана труда'],
    ['Другое', 'Главное меню']
]

office_vacancies_keyboard = [
    ['Закупки', 'Экономика'],
    ['HR', 'Сбыт', 'ИТ'],
    ['Юриспруденция', 'Производственное управление'],
    ['Промышленная безопасность и охрана труда'],
    ['Главное меню']
]

about_company_keyboard = [
    ['Преимущества работы в ПАО «Мосэнерго»'],
    ['Филиалы'],
    ['Мотивационные и социальные программы'],
    ['Главное меню'],
]
    
motivations_programms_keyboard = [
    ['Кадровый резерв'],
    ['Профессиональная подготовка и повышение квалификации за счет работодателя'],
    ['Соревнования профессионального мастерства'],
    ['Спортивные соревнования'],
    ['Корпоративные культурно-массовые мероприятия'],
    ['Совет молодых специалистов'],
    ['Главное меню'],
]

FAQ_keyboard = [
    ['💼 По какому графику я буду работать?'],
    ['💰 Какой уровень заработной платы мне ожидать?'],
    ['🏠 Какие компенсации существуют для иногородних кандидатов?'],
    ['🛡️ Какие социальные гарантии предоставляет Мосэнерго?'],
    ['📍 Адреса ТЭЦ Мосэнерго ГЭС-1'],
    ['👩‍🏫 На какие должности можно прийти без опыта?'],
    ['📝 Какие документы мне понадобятся при трудоустройстве?'],
    ['🚀 Есть ли в компании возможность карьерного роста?'],
    ['Главное меню'],

]