welcome_text = (
    'Добро пожаловать в официальный бот для поиска работы в Группе Газпром энергохолдинг индустриальные активы!\n\n'
    'Что может делать этот бот?\n\n'
    'Выдавать актуальные вакансии по ключевым словам.\n'
    'Просто напишите «электрик» или «стажер» в поисковую строку и он выдаст вам результат.\n\n'
    '⦁	Давать ответы на самые частые вопросы\n'
    '⦁	И многое другое!\n\n'
    '👇 Нажмите на меню и попробуйте сами'
)

welcome_two = (
    'Если вы уже готовы приступить к поиску, напишите нам ключевое\nслово вакансии в ответном сообщении, например: «без опыта» или\n«электрик» и мы выдадим вам результаты!'
)

inf_contacts_text = (
    'Специалист свяжется с вами в ближайшее время 📞\n\n'
    'Если вам не терпится связаться с нами, то позвоните по номеру  *ОЖИДАЕТСЯ*\n'
)

contacts_info = (
    'ОЖИДАЕТСЯ\n\n'
)
