welcome_text = (
    'Приветствуем вас в официальном боте по подбору персонала в ПАО «Вторая генерирующая компания оптового рынка электроэнергии» (ПАО «ОГК-2»)!\n\n'
    'Здесь вы можете:\n\n'
    '- узнать информацию о вакансиях и условиях работы в ПАО «ОГК-2»;\n\n'
    '- познакомиться с жизнью компании, льготами и гарантиями для персонала;\n\n'
    '- получить ответы на часто задаваемые вопросы.\n\n'
    'Внимание: чат-бот работает в тестовом режиме, мы делаем его лучше и удобнее для вас!\n\n'
    'Для поиска вакансии воспользуйтесь соответствующим пунктом меню или введите ключевое слово для поиска вакансии.'
)

welcome_two = (
    'Если вы уже готовы приступить к поиску, напишите нам ключевое\nслово вакансии в ответном сообщении, например: «без опыта» или\n«электрик» и мы выдадим вам результаты!'
)

inf_contacts_text = (
    'Специалист свяжется с вами в ближайшее время 📞\n\n'
    'Если вам не терпится связаться с нами, то позвоните по номеру  8-800-30-20-10-9\n'
)

contacts_info = (
    'Единый телефон справочной службы: 8-800-30-20-10-9 📞\n\n'
    '➖ Ставропольская ГРЭС — Ставропольский край, Изобильненский район, посёлок Солнечнодольск,\n'
    'ул. Техническая, д. 14, +7 (86545) 3-55-20, org@sta.ogk2.ru\n'
    '➖ Киришская ГРЭС — Ленинградская область, Киришский район, г. Кириши,\n'
    'ш. Энтузиастов, здание 32, +7 (81368) 9-31-50, kigres@ogk2.ru\n'
    '➖ Троицкая ГРЭС — Челябинская область, г. Троицк,\n'
    'филиал ПАО «ОГК-2» — Троицкая ГРЭС, +7 (35163) 5-93-59, info@tro.ogk2.ru\n'
    '➖ Новочеркасская ГРЭС — Ростовская область, г. Новочеркасск,\n'
    'ш. Багаевское, д. 10, +7 (8635) 28-23-30, nchgres@ogk2.ru\n'
    '➖ Псковская ГРЭС — Псковская область, Дедовичский район,\n'
    'р. п. Дедовичи, +7 (81136) 96-359, main@psk.ogk2.ru\n'
    '➖ Адлерская ТЭС — Краснодарский край, г. Сочи, Адлерский район,\n'
    'ул. Суздальская, д. 1А, +7 (862) 241-93-50, adler@ogk2.ru\n'
    '➖ Грозненская ТЭС — Чеченская Республика, г. Грозный,\n'
    'р-н Шейх-Мансуровский, ул. Имени Мохаммеда Бен Зайеда Аль Нахайяна,\n'
    'зд. 93, стр. 9, +7 (8712) 29-52-43, groztes@ogk2.ru\n'
    '➖ Свободненская ТЭС — Амурская область, муниципальный район Свободненский,\n'
    'сельское поселение Дмитриевский сельсовет, посёлок Юхта,\n'
    'здание 1, +7 (41643) 2-53-00, office.svb@ogk2.ru\n'
    '➖ Череповецкая ГРЭС — Вологодская область, Кадуйский район,\n'
    'рп Кадуй, ул. Промышленная, д. 2, +7 (81742) 51867, office_chg@chr.ogk2.ru\n'
    '➖ Сургутская ГРЭС-1 — Ханты-Мансийский автономный округ — Югра,\n'
    'г. о. Сургут, ул. Электротехническая, зд. 23/1,\n'
    '+7 (3462) 76-43-59, kanc@sur.ogk2.ru\n'
    '➖ Рязанская ГРЭС — Рязанская область, Пронский район,\n'
    'г. Новомичуринск, ул. Промышленная, д. 1,\n'
    '+7 (49141) 4-18-18, rgres@ogk2.ru\n'
    '➖ Серовская ГРЭС — Свердловская область, Серовский городской округ,\n'
    'г. Серов, ул. Пристанционная, 1, +7 (34385) 47-359, post@ser.ogk2.ru'
)
