region_voc = {
    'Ставропольский край': 'Ставропольская ГРЭС',
    'Ленинградская область': 'Киришская ГРЭС',
    'Челябинская область': 'Троицкая ГРЭС',
    'Ростовская область': 'Новочеркасская ГРЭС',
    'Псковская область': 'Псковская ГРЭС',
    'Краснодарский край': 'Адлерская ТЭС',
    'Чеченская Республика': 'Грозненская ТЭС',
    'Амурская область': 'Свободненская ТЭС',
    'Вологодская область': 'Череповецкая ГРЭС',
    'Ханты-Мансийский автономный округ - Югра': 'Сургутская ГРЭС-1',
    'Рязанская область': 'Рязанская ГРЭС',
    'Свердловская область': 'Серовская ГРЭС',
}

region_list = [
    'Ставропольская ГРЭС',
    'Киришская ГРЭС',
    'Троицкая ГРЭС',
    'Новочеркасская ГРЭС',
    'Псковская ГРЭС',
    'Адлерская ТЭС',
    'Грозненская ТЭС',
    'Свободненская ТЭС',
    'Череповецкая ГРЭС',
    'Сургутская ГРЭС-1',
    'Рязанская ГРЭС',
    'Серовская ГРЭС',
]


region_buttons_list = [
    ['Ставропольский край'],
    ['Ленинградская область'],
    ['Челябинская область'],
    ['Ростовская область'],
    ['Псковская область'],
    ['Краснодарский край'],
    ['Чеченская Республика'],
    ['Амурская область'],
    ['Вологодская область'],
    ['Ханты-Мансийский автономный округ - Югра'],
    ['Рязанская область'],
    ['Свердловская область'],
]