region_voc = {
    'г. Санкт-Петербург': 'г. Санкт-Петербург',
    'г. Москва': 'г. Москва',
    'Московская Область': 'Московская Область',
    'г. Тюмень': 'г. Тюмень',
    'г. Брянск': 'г. Брянск',
    'г. Щекино, Тульская обл.': 'г. Щекино, Тульская обл.',
    'г. Камышин, Волгоградская обл.': 'г. Камышин, Волгоградская обл.',
    'г. Екатеринбург': 'г. Екатеринбург',
    'г. Узловая': 'г. Узловая'
}


region_list = [
    'г. Санкт-Петербург',
    'г. Москва',
    'Московская Область',
    'г. Тюмень',
    'г. Брянск',
    'г. Щекино,'
    'Тульская обл.',
    'г. Камышин, Волгоградская обл.',
    'г. Екатеринбург',
    'г. Узловая'
]



region_buttons_list = [
    ['г. Санкт-Петербург', 'г. Санкт-Петербург'],
    ['г. Москва', 'г. Москва'],
    ['Московская Область', 'Московская Область'],
    ['г. Тюмень', 'г. Тюмень'], 
    ['г. Брянск', 'г. Брянск'],
    ['г. Щекино, Тульская обл.', 'г. Щекино, Тульская обл.'],
    ['г. Камышин, Волгоградская обл.', 'г. Камышин, Волгоградская обл.'],
    ['г. Екатеринбург', 'г. Екатеринбург'],
    ['г. Узловая', 'г. Узловая']
]