region_voc = {
    'Амурская область': 'Свободненская ТЭС',
    'Вологодская область': 'Череповецкая ГРЭС',
    'Грозненская ТЭС': 'Чеченская Республика',
    'Киришская ГРЭС': 'Ленинградская область',
    'Адлерская ТЭС': 'Краснодарский край',
    'Новочеркасская ГРЭС': 'Ростовская область',
    'Рязанская ГРЭС': 'Рязанская область',
    'Серовская ГРЭС': 'Свердловская область',
    'Ставропольская ГРЭС': 'Ставропольский край',
    'Сургутская ГРЭС-1': 'Ханты-Мансийский АО – Югра',
    'Псковская ГРЭС': 'Псковская область',
    'Троицкая ГРЭС': 'Челябинская область'
}

# region_list = [
#     'Ставропольская ГРЭС',
#     'Киришская ГРЭС',
#     'Троицкая ГРЭС',
#     'Новочеркасская ГРЭС',
#     'Псковская ГРЭС',
#     'Адлерская ТЭС',
#     'Грозненская ТЭС',
#     'Свободненская ТЭС',
#     'Череповецкая ГРЭС',
#     'Сургутская ГРЭС-1',
#     'Рязанская ГРЭС',
#     'Серовская ГРЭС',
# ]

region_list = [
    'Амурская область',
    'Вологодская область',
    'Грозненская Республика',
    'Краснодарский край',
    'Ленинградская область',
    'Псковская область',
    'Ростовская область',
    'Рязанская область',
    'Свердловская область',
    'Ставропольский край',
    'Тюменская область',
    'Чеченская Республика',
    'Челябинская область',
    'Ханты-Мансийский АО – Югра'
]



region_buttons_list = [
    ['Амурская область'],
    ['Вологодская область'],
    ['Грозненская Республика'],
    ['Краснодарский край'],
    ['Ленинградская область'],
    ['Псковская область'],
    ['Ростовская область'],
    ['Рязанская область'],
    ['Свердловская область'],
    ['Ставропольский край'],
    ['Тюменская область'],
    ['Чеченская Республика'],
    ['Челябинская область'],
    ['Ханты-Мансийский АО – Югра']
]